# Core WM & Desktop
i3-gaps
i3lock
i3blocks
i3status
polybar
picom
rofi
dunst
betterlockscreen
xautolock
xcape

# Terminal Emulators
kitty
alacritty

# File Manager & Utilities
thunar
thunar-volman

# Wallpaper & Display
feh
mpv
ffmpeg
arandr

# Screenshots & Input
maim
xclip
xdotool

# Audio
pamixer
pavucontrol

# Lock Screen & Idle
betterlockscreen

# Display Manager
sddm

# Bluetooth & Devices
blueman
udiskie

# Theming
qt5ct
qt6ct

# Network
networkmanager
network-manager-applet

# Fonts
ttf-hack-fonts
font-awesome

# System
polkit-gnome
dex
dbus
base-devel
git
curl
wget
python
python-pip
xorg-server
xorg-apps
xorg-xinit

# Update checker (for polybar)
pacman-contrib

# Misc
jq
